# Создайте программу для игры в ""Крестики-нолики"".

from random import choice as ch


def output(fld):
    print()
    for i in range(len(fld)):
        if i == 3:
            print()
        elif i == 6:
            print()
        print(fld[i], end=' ')
    print()
    print()


def player(fld):
    while True:
        move = input('Ваш ход: ').upper()
        if move in fld:
            c = fld.index(move)
            fld.insert(fld.index(move), 'X ')
            fld.remove(move)
            break
    return c


def bot(fld, mvs):
    while True:
        move = fld[ch(mvs)]
        if move != 'X ' and move != 'O ' and move in fld:
            print('Ход бота:', move)
            c = fld.index(move)
            fld.insert(fld.index(move), 'O ')
            fld.remove(move)
            break
    return c


def status(p, b, w, fld):
    if set(p) in w:
        print()
        print('Вы победили!')
        return 'Stop'
    elif set(b) in w:
        print()
        print('Вы проиграли!')
        return 'Stop'
    elif len(p)+len(b) == len(fld) and set(p) not in w:
        print()
        print('Ничья')
        return 'Stop'


field = ['A1', 'A2', 'A3', 'B1', 'B2', 'B3', 'C1', 'C2', 'C3']
win = [{0, 1, 2}, {0, 3, 6}, {0, 4, 8}, {1, 4, 7}, {2, 4, 6}, {2, 5, 8}, {3, 4, 5}, {6, 7, 8}, {0, 1, 2, 3}, {0, 1, 2, 4}, {0, 1, 2, 5}, {0, 1, 2, 6}, {0, 1, 2, 7}, {0, 1, 2, 8}, {0, 1, 3, 6}, {0, 2, 3, 6}, {0, 3, 4, 6}, {0, 3, 5, 6}, {0, 3, 6, 7}, {0, 3, 6, 8}, {0, 1, 4, 8}, {0, 2, 4, 8}, {0, 3, 4, 8}, {0, 4, 5, 8}, {0, 4, 6, 8}, {0, 4, 7, 8}, {0, 1, 4, 7}, {1, 2, 4, 7}, {1, 3, 4, 7}, {1, 4, 5, 7}, {1, 4, 6, 7}, {1, 4, 7, 8}, {0, 2, 4, 6}, {1, 2, 4, 6}, {2, 3, 4, 6}, {2, 4, 5, 6}, {2, 4, 6, 7}, {2, 4, 6, 8}, {0, 2, 5, 8}, {1, 2, 5, 8}, {2, 3, 5, 8}, {2, 4, 5, 8}, {2, 5, 6, 8}, {2, 5, 7, 8}, {0, 3, 4, 5}, {1, 3, 4, 5}, {2, 3, 4, 5}, {3, 4, 5, 6}, {3, 4, 5, 7}, {3, 4, 5, 8}, {0, 6, 7, 8}, {1, 6, 7, 8}, {2, 6, 7, 8}, {3, 6, 7, 8}, {4, 6, 7, 8}, {5, 6, 7, 8}, {0, 1, 2, 3, 4}, {0, 1, 2, 3, 5}, {0, 1, 2, 3, 6}, {0, 1, 2, 3, 7}, {0, 1, 2, 3, 8}, {0, 1, 2, 4, 5}, {0, 1, 2, 4, 6}, {0, 1, 2, 4, 7}, {0, 1, 2, 4, 8}, {0, 1, 2, 5, 6}, {0, 1, 2, 5, 7}, {0, 1, 2, 5, 8}, {0, 1, 2, 6, 7}, {0, 1, 2, 6, 8}, {0, 1, 2, 7, 8}, {0, 1, 3, 4, 6}, {0, 1, 3, 5, 6}, {0, 1, 3, 6, 7}, {0, 1, 3, 6, 8}, {0, 2, 3, 4, 6}, {0, 2, 3, 5, 6}, {0, 2, 3, 6, 7}, {0, 2, 3, 6, 8}, {0, 3, 4, 5, 6}, {0, 3, 4, 6, 7}, {0, 3, 4, 6, 8}, {0, 3, 5, 6, 7}, {
    0, 3, 5, 6, 8}, {0, 3, 6, 7, 8}, {0, 1, 3, 4, 8}, {0, 1, 4, 5, 8}, {0, 1, 4, 6, 8}, {0, 1, 4, 7, 8}, {0, 2, 3, 4, 8}, {0, 2, 4, 5, 8}, {0, 2, 4, 6, 8}, {0, 2, 4, 7, 8}, {0, 3, 4, 5, 8}, {0, 3, 4, 7, 8}, {0, 4, 5, 6, 8}, {0, 4, 5, 7, 8}, {0, 4, 6, 7, 8}, {0, 1, 3, 4, 7}, {0, 1, 4, 5, 7}, {0, 1, 4, 6, 7}, {1, 2, 3, 4, 7}, {1, 2, 4, 5, 7}, {1, 2, 4, 6, 7}, {1, 2, 4, 7, 8}, {1, 3, 4, 5, 7}, {1, 3, 4, 6, 7}, {1, 3, 4, 7, 8}, {1, 4, 5, 6, 7}, {1, 4, 5, 7, 8}, {1, 4, 6, 7, 8}, {0, 2, 4, 5, 6}, {0, 2, 4, 6, 7}, {1, 2, 3, 4, 6}, {1, 2, 4, 5, 6}, {1, 2, 4, 6, 8}, {2, 3, 4, 5, 6}, {2, 3, 7, 4, 6}, {2, 3, 4, 6, 8}, {2, 4, 5, 6, 7}, {2, 4, 5, 6, 8}, {2, 4, 6, 7, 8}, {0, 2, 3, 5, 8}, {0, 2, 5, 6, 8}, {0, 2, 5, 7, 8}, {1, 2, 3, 5, 8}, {1, 2, 4, 5, 8}, {1, 2, 5, 6, 8}, {1, 2, 5, 7, 8}, {2, 3, 4, 5, 8}, {2, 3, 5, 6, 8}, {2, 3, 5, 7, 8}, {2, 4, 5, 7, 8}, {2, 5, 6, 7, 8}, {0, 1, 3, 4, 5}, {0, 2, 3, 4, 5}, {0, 3, 4, 5, 7}, {1, 2, 3, 4, 5}, {1, 3, 4, 5, 6}, {1, 3, 4, 5, 8}, {2, 3, 4, 5, 7}, {3, 4, 5, 6, 7}, {3, 4, 5, 6, 8}, {3, 4, 5, 7, 8}, {0, 1, 6, 7, 8}, {0, 2, 6, 7, 8}, {0, 5, 6, 7, 8}, {1, 2, 6, 7, 8}, {1, 3, 6, 7, 8}, {1, 5, 6, 7, 8}, {2, 3, 6, 7, 8}, {2, 4, 6, 7, 8}, {3, 4, 6, 7, 8}, {3, 5, 6, 7, 8}, {4, 5, 6, 7, 8}, ]
moves = [i for i in range(len(field))]
wp = []
wb = []

print()
print('Игра "Крестики-нолики". Вы играете "Х", а бот "О"')
print('Чтобы сделать ход, необходимо ввести букву (А, В или С) и цифру (1, 2 или 3)')
output(field)

while True:
    a = player(field)
    wp.append(a)
    moves.remove(a)
    st = status(wp, wb, win, field)
    output(field)
    if st == 'Stop':
        print('Игра окончена')
        break
    b = bot(field, moves)
    wb.append(b)
    moves.remove(b)
    st = status(wp, wb, win, field)
    output(field)
    if st == 'Stop':
        print('Игра окончена')
        break